### 1.

**I can use 5 common functions to analysis the data. Those functions are:- head, dtypes, tail, columns, read_csv.**

In [1]:
import pandas as pd

In [3]:
u = {'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25, 30, 27],
    'Gender' : ['Female', 'Male', 'Female'],
     'Education': ['POST-GRAD', 'PHD', 'PHD'],
     'Profession' : ['Prof', 'CEO', 'Managing Director']
}

t = pd.DataFrame(u)

In [4]:
t.head()

     Name  Age  Gender  Education         Profession
0   Alice   25  Female  POST-GRAD               Prof
1     Bob   30    Male        PHD                CEO
2  Claire   27  Female        PHD  Managing Director

In [6]:
t.tail(1)

     Name  Age  Gender Education         Profession
2  Claire   27  Female       PHD  Managing Director

In [8]:
t.dtypes

Name          object
Age            int64
Gender        object
Education     object
Profession    object
dtype: object

In [9]:
t.columns

Index(['Name', 'Age', 'Gender', 'Education', 'Profession'], dtype='object')

In [10]:
pd.read_csv("C:\\Users\\DELL\\Desktop\\BasketballPlayerData.csv")

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

### 2.

In [11]:
r = {'A':[1,2,3],
     'B':[4,5,6],
     'C':[7,8,9]
    
}

In [13]:
df = pd.DataFrame(r)

In [16]:
new_index = [1,3,5]

In [17]:
df.reindex(new_index)

     A    B    C
1  2.0  5.0  8.0
3  NaN  NaN  NaN
5  NaN  NaN  NaN

### 3.

In [39]:
d = {'Value':[10, 20, 30, 40, 50]}

df = pd.DataFrame(d)

In [40]:
def SUM_VALUE(df):
    sum_val = df['Value'].head(3).sum()
    print(f"The sum of the first three values in the 'Values' column is: {sum_val}")

In [41]:
SUM_VALUE(df)

The sum of the first three values in the 'Values' column is: 60

### 4.

In [42]:
f = {'Text':['My name is SAYAN', 'I am 22 years old']}

In [44]:
df = pd.DataFrame(f)

In [46]:
df['Word_Count'] = 0

In [47]:
df

                Text  Word_Count
0   My name is SAYAN           0
1  I am 22 years old           0

In [48]:
def word_c(df):
    for index, row in df.iterrows():
        words = row['Text'].split()
        df.at[index, 'Word_Count'] = len(words)
    return df

In [51]:
d = word_c(df)

In [52]:
print(d)

                Text  Word_Count
0   My name is SAYAN           4
1  I am 22 years old           5

### 5.

**DataFrame.size() returns the total number of elements in the DataFrame, which is equivalent to the product of the number of rows and the number of columns. In other words, DataFrame.size() returns the total number of cells in the DataFrame.**

**DataFrame.shape() returns a tuple representing the dimensions of the DataFrame. The tuple contains two values: the number of rows and the number of columns, respectively. In other words, DataFrame.shape() returns the shape or size of the DataFrame, in terms of rows and columns.**

### 6.

**read_excel function of pandas do we use to read an excel file.**

### 7.

In [53]:
t = {'Email':['sayan@mysayan.com','ram@myram.com']}

In [55]:
df = pd.DataFrame(t)

In [56]:
def ext_user(df):
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
    return df

In [57]:
h = ext_user(df)
print(h)

               Email Username
0  sayan@mysayan.com    sayan
1      ram@myram.com      ram

### 8.

In [89]:
w = {'A':[3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}

In [90]:
df = pd.DataFrame(w)

In [91]:
def sel_row(df):
    select_r = df[(df['A'] > 5) & (df['B'] < 10)] 
    return select_r

In [92]:
c = sel_row(df)
print(c)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### 9.

In [111]:
k = {'Values':[2,7,9,5,1,3,8,10]}

In [112]:
df = pd.DataFrame(k)

In [113]:
df['Values']

0     2
1     7
2     9
3     5
4     1
5     3
6     8
7    10
Name: Values, dtype: int64

In [114]:
def CAL_VAL(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_der = df['Values'].std()
    return mean, median, std_der

In [115]:
mean, median, std_der = CAL_VAL(df)

In [116]:
print(f"Mean: {mean}, Median: {median}, Standard Derivation: {std_der}")

Mean: 5.625, Median: 6.0, Standard Derivation: 3.3779748793788102

### 10.

In [117]:
L = {'Date': ['2023-03-31', '2023-04-01', '2023-04-02', '2023-04-03', '2023-04-04', '2023-04-05', '2023-04-06'],
        'Sales': [100, 200, 300, 400, 500, 600, 700]}

In [122]:
df = pd.DataFrame(L)

In [136]:
def AVR_MOV(df):
    d = df.sort_values('Date')
    mn = df['Sales'].rolling(window=7, min_periods=1).mean()
    df['Moving Average'] = mn
    return df

In [137]:
g = AVR_MOV(df)

In [138]:
print(g)

         Date  Sales  Moving Average
0  2023-03-31    100           100.0
1  2023-04-01    200           150.0
2  2023-04-02    300           200.0
3  2023-04-03    400           250.0
4  2023-04-04    500           300.0
5  2023-04-05    600           350.0
6  2023-04-06    700           400.0

### 11.

In [139]:
b = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}

In [141]:
df = pd.DataFrame(b)

In [144]:
def WEEK_COL(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

In [145]:
s = WEEK_COL(df)

In [146]:
print(s)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### 12.

In [149]:
z = {'Date': ['2022-12-30', '2023-01-01', '2023-01-15', '2023-02-01', '2023-03-01']}
df = pd.DataFrame(z)

In [153]:
def DAT(df):
    df['Date'] = pd.to_datetime(df['Date'])
    b = df[(df['Date']>= '2023-01-01') & (df['Date']<= '2023-01-31')]
    return b

In [154]:
j = DAT(df)

In [155]:
print(j)

        Date
1 2023-01-01
2 2023-01-15

### 13.

**The first and foremost necessary library that needs to be imported to use the basic functions of pandas is the pandas library itself. The commonly used convention for importing pandas is:**

In [156]:
import pandas as pd